cask_args appdir: '/Applications'

# taps
tap 'azure/draft' || true
tap 'beeftornado/rmtree' || true
tap 'buo/cask-upgrade' || true
tap 'homebrew/bundle' || true
tap 'homebrew/cask' || true
tap 'homebrew/cask-drivers' || true
tap 'homebrew/cask-fonts' || true
tap 'homebrew/cask-versions' || true
tap 'homebrew/core' || true

# fonts
cask 'font-meslo-lg'
cask 'font-meslo-for-powerline'
cask 'font-meslo-nerd-font'

# version control
brew 'gist'
brew 'git'
brew 'hub'

# languages
brew 'go'
brew 'node'
brew 'python'
brew 'rbenv'
brew 'ruby-build'
brew 'rust'
cask 'java'

# utilities
brew 'autoconf'
brew 'automake'
brew 'autojump'
brew 'awk'
brew 'bash'
brew 'bat'
brew 'cmake'
brew 'coreutils'
brew 'dep'
brew 'diff-so-fancy'
brew 'draft'
brew 'fd'
brew 'ffmpeg'
brew 'fzf'
brew 'openssl'
brew 'jq'
brew 'kubernetes-cli'
brew 'kubernetes-helm'
brew 'lsd'
brew 'markdown'
brew 'mas'
brew 'mysql'
brew 'nano'
brew 'nmap'
brew 'neovim'
brew 'protobuf'
brew 'ripgrep'
brew 'shellcheck'
brew 'skaffold'
brew 'tmux'
brew 'watch'
brew 'wget'
brew 'yq'
brew 'zsh'

# applications
cask 'aerial'
cask 'appcleaner'
cask 'go2shell'
cask 'iterm2'
cask 'ngrok'
cask 'open-in-code'
cask 'slack'
cask 'spectacle'
cask 'visual-studio-code'
cask 'zoomus'